### Step 1: imports

In [20]:
import pandas as pd
import plotly.express as px
import sqlalchemy

### Step 1b: Import the Data

In [64]:
df = pd.read_csv(r'C:\Users\bioni\OneDrive\Documents\GitHub\Coding_Temple\Wk 6\Assignments\D2\Taylor_Train.csv', encoding="latin-1")
df.head()

,City,Country,Venue,Opening act(s),Attendance (tickets sold / available),Revenue,Tour
0,Evansville,United States,Roberts Municipal Stadium,Gloriana\r\nKellie Pickler,"7,463 / 7,463","$360,617",Fearless_Tour
1,Jonesboro,United States,Convocation Center,Gloriana\r\nKellie Pickler,"7,822 / 7,822","$340,328",Fearless_Tour
2,St. Louis,United States,Scottrade Center,Gloriana\r\nKellie Pickler,"13,764 / 13,764","$650,420",Fearless_Tour
3,Alexandria,United States,Bishop Ireton High School,Gloriana\r\nKellie Pickler,,,Fearless_Tour
4,North Charleston,United States,North Charleston Coliseum,Gloriana\r\nKellie Pickler,"8,751 / 8,751","$398,154",Fearless_Tour

### Step 2: Tidy the Data

In [65]:
df['Opening act(s)'] = df['Opening act(s)'].str.strip().str.replace('\r\n', ' ')
df['Opening act(s)']

0      Gloriana Kellie Pickler
1      Gloriana Kellie Pickler
2      Gloriana Kellie Pickler
3      Gloriana Kellie Pickler
4      Gloriana Kellie Pickler
                ...
440          Charli XCX Broods
441          Charli XCX Broods
442          Charli XCX Broods
443                 Charli XCX
444                 Charli XCX
Name: Opening act(s), Length: 445, dtype: object

In [66]:
def split_tickets_sold(text):
    if text:
        value = text.split("/")[0]
    else:
        value = 0
    return value

def split_tickets_available(text):
    if text:
        value = text.split("/")[1]
    else:
        value = 0
    return value

df["tickets_sold"] = df["Attendance (tickets sold / available)"].str.split('tickets_sold')
df["tickets_sold"] = pd.to_numeric(df["tickets_sold"].str.replace(",",""))
df["tickets_available"] = df["Attendance (tickets sold / available)"].str.split('tickets_available')
df["tickets_available"] = pd.to_numeric(df["tickets_available"].str.replace(",",""))
# df = df.drop("Attendance (tickets sold / available)",axis=1)
df.tail()

,City,Country,Venue,Opening act(s),Attendance (tickets sold / available),Revenue,Tour,tickets_sold,tickets_available
440,Sydney,Australia,ANZ Stadium,Charli XCX Broods,"72,805 / 72,805","$7,686,564",Reputation_Stadium_Tour,NaN,NaN
441,Brisbane,Australia,The Gabba,Charli XCX Broods,"43,907 / 43,907","$4,338,127",Reputation_Stadium_Tour,NaN,NaN
442,Auckland,New Zealand,Mount Smart Stadium,Charli XCX Broods,"35,749 / 35,749","$3,617,593",Reputation_Stadium_Tour,NaN,NaN
443,Tokyo,Japan,Tokyo Dome,Charli XCX,"100,109 / 100,109","$14,859,847",Reputation_Stadium_Tour,NaN,NaN
444,Tokyo,Japan,Tokyo Dome,Charli XCX,"100,109 / 100,109","$14,859,847",Reputation_Stadium_Tour,NaN,NaN

In [67]:
df.columns = df.columns.str.lower().str.strip().str.replace(' ', '_')
df.columns

Index(['city', 'country', 'venue', 'opening_act(s)',
       'attendance_(tickets_sold_/_available)', 'revenue', 'tour',
       'tickets_sold', 'tickets_available'],
      dtype='object')

### Step 3: EDA (Exploratory Data Analysis)
We begin exploring and gathering summary statistics about our dataset and arm ourselves with as much knowledge as possible about what it is we are working with.

We also going to take the time in this section to see if there is any further tidying up that needs to be accomplished before we can begin moving forward.

- df.describe()
- df.info()
- df.value_count()

In [61]:
df.describe()

       tickets_sold  tickets_available
count           0.0                0.0
mean            NaN                NaN
std             NaN                NaN
min             NaN                NaN
25%             NaN                NaN
50%             NaN                NaN
75%             NaN                NaN
max             NaN                NaN

In [62]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 445 entries, 0 to 444
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   city               445 non-null    object
 1   country            445 non-null    object
 2   venue              445 non-null    object
 3   opening_act(s)     444 non-null    object
 4   revenue            442 non-null    object
 5   tour               445 non-null    object
 6   tickets_sold       0 non-null      float64
 7   tickets_available  0 non-null      float64
dtypes: float64(2), object(6)
memory usage: 27.9+ KB

In [31]:
df[['attendance_(ticket_sold_/_available)']] = df['attendance_(tickets_sold_/_available)'].str.split('_/_', n = 1, expand= True)

df[['attendance_(ticket_sold_/_available)']]

    attendance_(ticket_sold_/_available)
0                          7,463 / 7,463
1                          7,822 / 7,822
2                        13,764 / 13,764
3                                      
4                          8,751 / 8,751
..                                   ...
440                      72,805 / 72,805
441                      43,907 / 43,907
442                      35,749 / 35,749
443                    100,109 / 100,109
444                    100,109 / 100,109

[445 rows x 1 columns]

In [63]:
df.value_counts()

Series([], Name: count, dtype: int64)